---
kind: method
id: M:Autodesk.Revit.DB.CurveLoopIterator.Dispose
source: html/d9860571-d570-d2c4-e1fd-fa9f08c929e1.htm
---
# Autodesk.Revit.DB.CurveLoopIterator.Dispose Method

Releases all resources used by the CurveLoopIterator

## Syntax (C#)
```csharp
public void Dispose()
```